base-case/airfoil-test/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.33e-4;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.3e-4;
    }

    outlet
    {
        type            calculated;
	value		uniform 1.3e-4;
    }

    symBoundTop
    {
        type            symmetryPlane;
    }

    symBoundBottom
    {
        type            symmetryPlane;
    }

    flatPlate
    {
	type		fixedValue;
	value		uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
