base-case/airfoil-test/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 17.46;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           367.3;
    }

    outlet
    {
        type            zeroGradient;
    }

    symBoundTop
    {
        type            symmetryPlane;
    }

    symBoundBottom
    {
        type            symmetryPlane;
    }

    flatPlate
    {
        type            fixedValue;
        value           1e7;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
