base-case/airfoil-test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    b2-symmetry_y_strong
    {
        type            patch;
        physicalType    patch;
        nFaces          14336;
        startFace       28384;
    }
    b3-symmetry_y_strong
    {
        type            patch;
        physicalType    patch;
        nFaces          14336;
        startFace       42720;
    }
    b4-farfield_riem
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       57056;
    }
    b5-farfield_riem
    {
        type            patch;
        physicalType    patch;
        nFaces          64;
        startFace       57120;
    }
    b6-viscous_solid
    {
        type            patch;
        physicalType    patch;
        nFaces          128;
        startFace       57184;
    }
    b7-farfield_riem
    {
        type            patch;
        physicalType    patch;
        nFaces          224;
        startFace       57312;
    }
    b8-to-stitch-a
    {
        type            patch;
        physicalType    patch;
        nFaces          48;
        startFace       57536;
    }
    defaultFaces
    {
        type            patch;
        nFaces          48;
        startFace       57584;
    }
)

// ************************************************************************* //
