base-case/airfoil-test/system/sampleU
setFormat raw;
surfaceFormat raw;
interpolationScheme cellPoint;
writeControl    writeTime;

fields
(
	mag(U)
);

 type  sets;
 sets
 (
   line
   {
      type lineFace;
      axis x;

      start ( 0  7.653239854e-05 0.05);
      end ( 2.9  7.653239854e-05 0.05);
   }

 );
